print('1 ------------------------------')
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
print(30 in a)
print(100 in a)

a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
print(30 not in a)
print(100 not in a)
print(43 in (38, 76, 43, 62, 19))
print( 1 in range(10))

print('2 ------------------------------')
a = [0, 10, 20, 30]
b = [9, 8, 7, 6]
print(a+b)

print('3 ------------------------------')
print(list(range(0, 10)) + list(range(10, 20)))
print( tuple(range(0, 10)) + tuple(range(10, 20)))
print('Hello, ' + str(10)  )

print('4 ------------------------------')
print(list(range(0, 5, 2)) * 3)
print(tuple(range(0, 5, 2)) * 3)
print( 'Hello, ' * 3)

print('5 ------------------------------')
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
print(len(a))
b = (38, 76, 43, 62, 19)
print(len(b))
print(len(range(0, 10, 2)))
hello = 'Hello, world!'
print(hello)

print('6 ------------------------------')
a = [38, 21, 53, 62, 19]
print(a[0])
print(a[2])
print(a[3])
b = (38, 21, 53, 62, 19)
print( b[0])
r = range(0, 10, 2)
print(r[2])
hello = 'Hello, world!'
print(hello[7])
print('7 ------------------------------')
a = [38, 21, 53, 62, 19]
print(a[-1])
print(a[-3])
print(a[-5])
b = (38, 21, 53, 62, 19)
print(b[-5])
print(b[-1])
r = range(0, 10, 2)
print(r[-1])
hello = 'Hello, world!'
print(hello[-4])

print('8 ------------------------------')
a = [0, 0, 0, 0, 0]    # 0이 5개 들어있는 리스트
a[0] = 38
a[1] = 21
a[2] = 53
a[3] = 62
a[4] = 19
print(a)

print('9 ------------------------------')
a = [38, 21, 53, 62, 19]
print(len(a))
del a[2]
print(len(a))
print(a)

print('10 ------------------------------')
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
print(a)
print(a[0:4])
print(a)
print('11 ------------------------------')
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
print(a[1:1])    # 인덱스 1부터 0까지 잘라서 새 리스트를 만듦
print(a[1:2])    # 인덱스 1부터 1까지 잘라서 새 리스트를 만듦
print('12 ------------------------------')
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
print(a[4:7] )    # 인덱스 4부터 6까지 요소 3개를 가져옴
print(a[4:-1])

a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
print(a[2:8:3])    # 인덱스 2부터 3씩 증가시키면서 인덱스 7까지 가져옴
print(a[2:9:3] )
print(a[5:1:-1])

print('13 ------------------------------')
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
print(a[:7])    # 리스트 처음부터 인덱스 6까지 가져옴
[0, 10, 20, 30, 40, 50, 60]
print(a[7:])
print(a[:])

print('13 ------------------------------')
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
print(a[:7:2])    # 리스트의 처음부터 인덱스를 2씩 증가시키면서 인덱스 6까지 가져옴
[0, 20, 40, 60]

print('14 ------------------------------')
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
print(a[0:len(a)])    # 시작 인덱스에 0, 끝 인덱스에 len(a) 지정하여 리스트 전체를 가져옴
print(a[:len(a)] )    # 시작 인덱스 생략, 끝 인덱스에 len(a) 지정하여 리스트 전체를 가져옴

b = (0, 10, 20, 30, 40, 50, 60, 70, 80, 90)
print(b[4:7] )    # 인덱스 4부터 6까지 요소 3개를 가져옴
print(b[4:]  )    # 인덱스 4부터 마지막 요소까지 가져옴
print(b[:7:2])    # 튜플의 처음부터 인덱스를 2씩 증가시키면서 인덱스 6까지 가져옴

r = range(10)
print(r)
print(r[4:7] )    # 인덱스 4부터 6까지 숫자 3개를 생성하는 range 객체를 만듦
print(r[4:]  )    # 인덱스 4부터 9까지 숫자 6개를 생성하는 range 객체를 만듦
print(r[:7:2])    # 인덱스 0부터 2씩 증가시키면서 인덱스 6까지 숫자 4개를 생성하는 range 객체를 만듦
print(list(r[:7:2]))
hello = 'Hello, world!'
print(hello[2:9])
print(hello[2:])
print(hello[:9:2])

print('15 ------------------------------')
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
a[2:5] = ['a', 'b', 'c']
print(a)
a[2:5] = ['a']
print(a)
a[2:5] = ['a', 'b', 'c', 'd', 'e']
print(a)
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
a[2:8:2] = ['a', 'b', 'c']
print(a)
print('16 ------------------------------')
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
del a[2:5]
print(a)
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
del a[2:8:2]
print(a)